#include <reg52.h>

sbit SCL=P1^5;
sbit SDA=P1^6;

/*******************************************************************************
* º¯ÊıÃû         : Delay10us()
* º¯Êı¹¦ÄÜ		   : ÑÓÊ±10us
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void Delay10us()
{
	unsigned char a,b;
	for(b=1;b>0;b--)
		for(a=2;a>0;a--);

}
/*******************************************************************************
* º¯ÊıÃû         : I2cStart()
* º¯Êı¹¦ÄÜ		 : ÆğÊ¼ĞÅºÅ£ºÔÚSCLÊ±ÖÓĞÅºÅÔÚ¸ßµçÆ½ÆÚ¼äSDAĞÅºÅ²úÉúÒ»¸öÏÂ½µÑØ
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
* ±¸×¢           : ÆğÊ¼Ö®ºóSDAºÍSCL¶¼Îª0
*******************************************************************************/

void I2cStart()
{
	SDA=1;
	Delay10us();
	SCL=1;
	Delay10us();//½¨Á¢Ê±¼äÊÇSDA±£³ÖÊ±¼ä>4.7us
	SDA=0;
	Delay10us();//±£³ÖÊ±¼äÊÇ>4us
	SCL=0;			
	Delay10us();		
}
/*******************************************************************************
* º¯ÊıÃû         : I2cStop()
* º¯Êı¹¦ÄÜ		 : ÖÕÖ¹ĞÅºÅ£ºÔÚSCLÊ±ÖÓĞÅºÅ¸ßµçÆ½ÆÚ¼äSDAĞÅºÅ²úÉúÒ»¸öÉÏÉıÑØ
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
* ±¸×¢           : ½áÊøÖ®ºó±£³ÖSDAºÍSCL¶¼Îª1£»±íÊ¾×ÜÏß¿ÕÏĞ
*******************************************************************************/

void I2cStop()
{
	SDA=0;
	Delay10us();
	SCL=1;
	Delay10us();//½¨Á¢Ê±¼ä´óÓÚ4.7us
	SDA=1;
	Delay10us();		
}
/*******************************************************************************
* º¯ÊıÃû         : I2cSendByte(unsigned char dat)
* º¯Êı¹¦ÄÜ		   : Í¨¹ıI2C·¢ËÍÒ»¸ö×Ö½Ú¡£ÔÚSCLÊ±ÖÓĞÅºÅ¸ßµçÆ½ÆÚ¼ä£¬±£³Ö·¢ËÍĞÅºÅSDA±£³ÖÎÈ¶¨
* ÊäÈë           : num
* Êä³ö         	 : 0»ò1¡£·¢ËÍ³É¹¦·µ»Ø1£¬·¢ËÍÊ§°Ü·µ»Ø0
* ±¸×¢           : ·¢ËÍÍêÒ»¸ö×Ö½ÚSCL=0,SDA=1
*******************************************************************************/

unsigned char I2cSendByte(unsigned char dat)
{
	unsigned char a=0,b=0;//×î´ó255£¬Ò»¸ö»úÆ÷ÖÜÆÚÎª1us£¬×î´óÑÓÊ±255us¡£		
	for(a=0;a<8;a++)//Òª·¢ËÍ8Î»£¬´Ó×î¸ßÎ»¿ªÊ¼
	{
		SDA=dat>>7;	 //ÆğÊ¼ĞÅºÅÖ®ºóSCL=0£¬ËùÒÔ¿ÉÒÔÖ±½Ó¸Ä±äSDAĞÅºÅ
		dat=dat<<1;
		Delay10us();
		SCL=1;
		Delay10us();//½¨Á¢Ê±¼ä>4.7us
		SCL=0;
		Delay10us();//Ê±¼ä´óÓÚ4us		
	}
	SDA=1;
	Delay10us();
	SCL=1;
	while(SDA)//µÈ´ıÓ¦´ğ£¬Ò²¾ÍÊÇµÈ´ı´ÓÉè±¸°ÑSDAÀ­µÍ
	{
		b++;
		if(b>200)	 //Èç¹û³¬¹ı2000usÃ»ÓĞÓ¦´ğ·¢ËÍÊ§°Ü£¬»òÕßÎª·ÇÓ¦´ğ£¬±íÊ¾½ÓÊÕ½áÊø
		{
			SCL=0;
			Delay10us();
			return 0;
		}
	}
	SCL=0;
	Delay10us();
 	return 1;		
}
/*******************************************************************************
* º¯ÊıÃû         : I2cReadByte()
* º¯Êı¹¦ÄÜ		   : Ê¹ÓÃI2c¶ÁÈ¡Ò»¸ö×Ö½Ú
* ÊäÈë           : ÎŞ
* Êä³ö         	 : dat
* ±¸×¢           : ½ÓÊÕÍêÒ»¸ö×Ö½ÚSCL=0,SDA=1.
*******************************************************************************/

unsigned char I2cReadByte()
{
	unsigned char a=0,dat=0;
	SDA=1;			//ÆğÊ¼ºÍ·¢ËÍÒ»¸ö×Ö½ÚÖ®ºóSCL¶¼ÊÇ0
	Delay10us();
	for(a=0;a<8;a++)//½ÓÊÕ8¸ö×Ö½Ú
	{
		SCL=1;
		Delay10us();
		dat<<=1;
		dat|=SDA;
		Delay10us();
		SCL=0;
		Delay10us();
	}
	return dat;		
}


/*******************************************************************************
* º¯ÊıÃû         : void At24c02Write(unsigned char addr,unsigned char dat)
* º¯Êı¹¦ÄÜ		   : Íù24c02µÄÒ»¸öµØÖ·Ğ´ÈëÒ»¸öÊı¾İ
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void At24c02Write(unsigned char addr,unsigned char dat)
{
	I2cStart();
	I2cSendByte(0xa0);//·¢ËÍĞ´Æ÷¼şµØÖ·
	I2cSendByte(addr);//·¢ËÍÒªĞ´ÈëÄÚ´æµØÖ·
	I2cSendByte(dat);	//·¢ËÍÊı¾İ
	I2cStop();
}
/*******************************************************************************
* º¯ÊıÃû         : unsigned char At24c02Read(unsigned char addr)
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡24c02µÄÒ»¸öµØÖ·µÄÒ»¸öÊı¾İ
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

unsigned char At24c02Read(unsigned char addr)
{
	unsigned char num ;
	I2cStart();
	I2cSendByte(0xa0); //·¢ËÍĞ´Æ÷¼şµØÖ·
	I2cSendByte(addr); //·¢ËÍÒª¶ÁÈ¡µÄµØÖ·
	I2cStart();
	I2cSendByte(0xa1); //·¢ËÍ¶ÁÆ÷¼şµØÖ·
	num=I2cReadByte(); //¶ÁÈ¡Êı¾İ
	I2cStop();
	return num;	
}

sbit relay1 = P2^2;  //Ë®Ñ­»·¼ÌµçÆ÷
sbit relay2 = P2^1;	 //¼ÓÈÈ¼ÌµçÆ÷
sbit relay3 = P2^0;	 //³äÑõ¼ÌµçÆ÷

//ÑÓÊ±º¯Êı
void delayms( uint ms )
{
	uchar i;
	while ( ms-- )
	{
		for (i=0;i<120;i++);
	}
}

void main()
{
	uchar n,i;
	while(1){
	for(i=0;i<5;i++)
	{
		At24c02Write(0x00,i);   //ÎÂ¶È×îµÍ
		delayms(5);
		n=At24c02Read(0x00);
		delayms(5);
		if(n==1)
			{relay1=0;}
			else if(n==2)
			{relay2=0;}
			else if(n==3)
			{relay3=0;}
			else if(n==4)
			{
		    relay1 = 1;  //Ë®Ñ­»·¼ÌµçÆ÷
        relay2 = 1;	 //¼ÓÈÈ¼ÌµçÆ÷
				relay3 = 1;	 //³äÑõ¼ÌµçÆ
			}
		delayms(3000);
		}
	}
}