#ifndef __KEY_SCAN_H_
#define	__KEY_SCAN_H_

sbit k1=P3^4;	 //定义P10口是k1
sbit k2=P3^5;	 //定义P10口是k1
sbit k3=P3^6;	 //定义P10口是k1
sbit k4=P3^7;	 //定义P10口是k1

/*******************************************************************************
* 函 数 名         : keypros
* 函数功能		   : 按键处理函数，判断按键K1是否按下
*******************************************************************************/
void key_scan(uint *key,uint *key1)
{
	uint i=0;
	if(k1==0)		  //检测按键K1是否按下
	{	
		delayms(5);   //消除抖动 一般大约10ms
		if(k1==0)	 //再次判断按键是否按下
		{
			*key = 1;
		}
		while(!k1);	 //检测按键是否松开
	}		
	else if(k2==0)		  //检测按键K1是否按下
	{	
		delayms(5);   //消除抖动 一般大约10ms
		if(k2==0)	 //再次判断按键是否按下
		{
			*key = 2;
		}
		while(!k2)	 //检测按键是否松开
			{i++;delayms(1);}
		if(i>500)
			{*key1=2;}
	}	
	else if(k3==0)		  //检测按键K1是否按下
	{	
		delayms(5);   //消除抖动 一般大约10ms
		if(k3==0)	 //再次判断按键是否按下
		{
			*key = 3;
		}
		while(!k3)	 //检测按键是否松开
			{i++;delayms(1);}
		if(i>500)
			{*key1=3;}
	}	
	else if(k4==0)		  //检测按键K1是否按下
	{	
		delayms(5);   //消除抖动 一般大约10ms
		if(k4==0)	 //再次判断按键是否按下
		{
			*key = 4;
		}
		while(!k4)	 //检测按键是否松开
			{i++;delayms(1);}
		if(i>500)
			{*key1=4;}
	}
i=0;	
}

#endif