/*************************************************************************************

*
ÊµÑéÏÖÏó£ºÏÂÔØ³ÌĞòºó°´ÏÂK1°´¼ü¿ÉÒÔ¶ÔD1Ğ¡µÆ×´Ì¬È¡·´
½ÓÏßËµÃ÷£º (¾ßÌå½ÓÏßÍ¼¿É¼û¿ª·¢¹¥ÂÔ¶ÔÓ¦ÊµÑéµÄ¡°ÊµÑéÏÖÏó¡±ÕÂ½Ú)
		   1£¬µ¥Æ¬»ú-->LED&½»Í¨µÆÄ£¿é
		   P00-->D1
		   2£¬µ¥Æ¬»ú-->¶ÀÁ¢°´¼üÄ£¿é
		   P10-->K1	
×¢ÒâÊÂÏî£º										

										  
**************************************************************************************

*/

#include "reg52.h"


sbit k1=P3^4;	 //¶¨ÒåP10¿ÚÊÇk1
sbit k2=P3^5;	 //¶¨ÒåP10¿ÚÊÇk1
sbit k3=P3^6;	 //¶¨ÒåP10¿ÚÊÇk1
sbit k4=P3^7;	 //¶¨ÒåP10¿ÚÊÇk1
sbit relay1 = P2^2;  //Ë®Ñ­»·¼ÌµçÆ÷
sbit relay2 = P2^1;	 //¼ÓÈÈ¼ÌµçÆ÷
sbit relay3 = P2^0;	 //³äÑõ¼ÌµçÆ÷

/*******************************************************************************
* º¯ Êı Ãû         : delay
* º¯Êı¹¦ÄÜ		   : ÑÓÊ±º¯Êı£¬i=1Ê±£¬´óÔ¼ÑÓÊ±10us
*******************************************************************************/
void delay(uint i)
{
	while(i--);	
}

/*******************************************************************************
* º¯ Êı Ãû         : keypros
* º¯Êı¹¦ÄÜ		   : °´¼ü´¦Àíº¯Êı£¬ÅĞ¶Ï°´¼üK1ÊÇ·ñ°´ÏÂ
*******************************************************************************/
uint keypros()
{
	if(k1==0)		  //¼ì²â°´¼üK1ÊÇ·ñ°´ÏÂ
	{	
		delay(1000);   //Ïû³ı¶¶¶¯ Ò»°ã´óÔ¼10ms
		if(k1==0)	 //ÔÙ´ÎÅĞ¶Ï°´¼üÊÇ·ñ°´ÏÂ
		{
			return 1;
		}
		while(!k1);	 //¼ì²â°´¼üÊÇ·ñËÉ¿ª
	}		
	else if(k2==0)		  //¼ì²â°´¼üK1ÊÇ·ñ°´ÏÂ
	{	
		delay(1000);   //Ïû³ı¶¶¶¯ Ò»°ã´óÔ¼10ms
		if(k2==0)	 //ÔÙ´ÎÅĞ¶Ï°´¼üÊÇ·ñ°´ÏÂ
		{
			return 2;
		}
		while(!k2);	 //¼ì²â°´¼üÊÇ·ñËÉ¿ª
	}	
	else if(k3==0)		  //¼ì²â°´¼üK1ÊÇ·ñ°´ÏÂ
	{	
		delay(1000);   //Ïû³ı¶¶¶¯ Ò»°ã´óÔ¼10ms
		if(k3==0)	 //ÔÙ´ÎÅĞ¶Ï°´¼üÊÇ·ñ°´ÏÂ
		{
			return 3;
		}
		while(!k3);	 //¼ì²â°´¼üÊÇ·ñËÉ¿ª
	}	
	else if(k4==0)		  //¼ì²â°´¼üK1ÊÇ·ñ°´ÏÂ
	{	
		delay(1000);   //Ïû³ı¶¶¶¯ Ò»°ã´óÔ¼10ms
		if(k4==0)	 //ÔÙ´ÎÅĞ¶Ï°´¼üÊÇ·ñ°´ÏÂ
		{
			return 4;
		}
		while(!k4);	 //¼ì²â°´¼üÊÇ·ñËÉ¿ª
	}	
	return 0;
}

/*******************************************************************************
* º¯ Êı Ãû       : main
* º¯Êı¹¦ÄÜ		 : Ö÷º¯Êı
* Êä    Èë       : ÎŞ
* Êä    ³ö    	 : ÎŞ
*******************************************************************************/
void main()
{	
	int n;
	while(1)
	{	
		  n=keypros();  //°´¼ü´¦Àíº¯Êı
			if(n==1)
			{relay1=0;}
			else if(n==2)
			{relay2=0;}
			else if(n==3)
			{relay3=0;}
			else if(n==4)
			{
		    relay1 = 1;  //Ë®Ñ­»·¼ÌµçÆ÷
        relay2 = 1;	 //¼ÓÈÈ¼ÌµçÆ÷
				relay3 = 1;	 //³äÑõ¼ÌµçÆ
			}
			
	}		
}